Revit 2027 API
ParameterTypeId.ViewVisibleCategories Property
 "Visibility/Graphics Overrides"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewVisibleCategories { get; }
Public Shared ReadOnly Property ViewVisibleCategories As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewVisibleCategories {
	ForgeTypeId^ get ();
}
static member ViewVisibleCategories : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace